#Скрипт, запускающий 10 коннектов последовательно
for (( i=0; i < 10; i++ ))
do
    java CalculClient localhost 9898    # если запускаете на разных машинах, менять надо только адрес сервера, т.е локалхост
done

echo "Последовательное выполнение закончено"

#read -n 1 -s -r -p "Press any key to continue"

#Скрипт, запускающий 10 коннектов параллельно
for (( i=0; i < 10; i++ ))
do
    java CalculClient localhost 9898 &   # если запускаете на разных машинах, менять надо только адрес сервера, т.е локалхост
done
wait
echo "Параллельное выполнение закончено"